grevaillot/svd_tools/headers/STM32H7x7_CM4/gpiof.h
#define GPIOF_GPIO_OSPEEDR_OSPEED3_SHIFT		6
#define GPIOF_GPIO_OSPEEDR_OSPEED3_MASK		0x03
/** @defgroup gpiof_gpio_ospeedr_ospeed3 OSPEED3 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOF_GPIO_OSPEEDR_OSPEED2_SHIFT		4
#define GPIOF_GPIO_OSPEEDR_OSPEED2_MASK		0x03
/** @defgroup gpiof_gpio_ospeedr_ospeed2 OSPEED2 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOF_GPIO_OSPEEDR_OSPEED1_SHIFT		2
#define GPIOF_GPIO_OSPEEDR_OSPEED1_MASK		0x03
/** @defgroup gpiof_gpio_ospeedr_ospeed1 OSPEED1 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOF_GPIO_OSPEEDR_OSPEED0_SHIFT		0
#define GPIOF_GPIO_OSPEEDR_OSPEED0_MASK		0x03
/** @defgroup gpiof_gpio_ospeedr_ospeed0 OSPEED0 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


/**@}*/

/** @defgroup gpiof_gpio_pupdr GPIOPUPDR GPIO port pull-up/pull-down register
@{*/


#define GPIOF_GPIO_PUPDR_PUPD15_SHIFT		30
#define GPIOF_GPIO_PUPDR_PUPD15_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd15 PUPD15 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD14_SHIFT		28
#define GPIOF_GPIO_PUPDR_PUPD14_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd14 PUPD14 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD13_SHIFT		26
#define GPIOF_GPIO_PUPDR_PUPD13_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd13 PUPD13 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD12_SHIFT		24
#define GPIOF_GPIO_PUPDR_PUPD12_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd12 PUPD12 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD11_SHIFT		22
#define GPIOF_GPIO_PUPDR_PUPD11_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd11 PUPD11 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD10_SHIFT		20
#define GPIOF_GPIO_PUPDR_PUPD10_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd10 PUPD10 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD9_SHIFT		18
#define GPIOF_GPIO_PUPDR_PUPD9_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd9 PUPD9 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD8_SHIFT		16
#define GPIOF_GPIO_PUPDR_PUPD8_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd8 PUPD8 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD7_SHIFT		14
#define GPIOF_GPIO_PUPDR_PUPD7_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd7 PUPD7 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD6_SHIFT		12
#define GPIOF_GPIO_PUPDR_PUPD6_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd6 PUPD6 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD5_SHIFT		10
#define GPIOF_GPIO_PUPDR_PUPD5_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd5 PUPD5 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD4_SHIFT		8
#define GPIOF_GPIO_PUPDR_PUPD4_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd4 PUPD4 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD3_SHIFT		6
#define GPIOF_GPIO_PUPDR_PUPD3_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd3 PUPD3 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD2_SHIFT		4
#define GPIOF_GPIO_PUPDR_PUPD2_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd2 PUPD2 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD1_SHIFT		2
#define GPIOF_GPIO_PUPDR_PUPD1_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd1 PUPD1 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOF_GPIO_PUPDR_PUPD0_SHIFT		0
#define GPIOF_GPIO_PUPDR_PUPD0_MASK		0x03
/** @defgroup gpiof_gpio_pupdr_pupd0 PUPD0 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


/**@}*/

/** @defgroup gpiof_gpio_idr GPIOIDR GPIO port input data register
@{*/

/** GPIOF_GPIO_IDR_ID15 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID15		(1 << 15)
/** GPIOF_GPIO_IDR_ID14 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID14		(1 << 14)
/** GPIOF_GPIO_IDR_ID13 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID13		(1 << 13)
/** GPIOF_GPIO_IDR_ID12 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID12		(1 << 12)
/** GPIOF_GPIO_IDR_ID11 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID11		(1 << 11)
/** GPIOF_GPIO_IDR_ID10 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID10		(1 << 10)
/** GPIOF_GPIO_IDR_ID9 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID9		(1 << 9)
/** GPIOF_GPIO_IDR_ID8 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID8		(1 << 8)
/** GPIOF_GPIO_IDR_ID7 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID7		(1 << 7)
/** GPIOF_GPIO_IDR_ID6 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID6		(1 << 6)
/** GPIOF_GPIO_IDR_ID5 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID5		(1 << 5)
/** GPIOF_GPIO_IDR_ID4 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID4		(1 << 4)
/** GPIOF_GPIO_IDR_ID3 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID3		(1 << 3)
/** GPIOF_GPIO_IDR_ID2 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID2		(1 << 2)
/** GPIOF_GPIO_IDR_ID1 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID1		(1 << 1)
/** GPIOF_GPIO_IDR_ID0 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOF_GPIO_IDR_ID0		(1 << 0)

/**@}*/

